jeromecoutant/mbed/features/FEATURE_BLE/targets/TARGET_STM/TARGET_STM32WB/HCIDriver.cpp
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;

PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t HciAclDataBuffer[MAX_HCI_ACL_PACKET_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t EvtPool[POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t     SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t     BleSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];


/**
 * Cordio HCI driver factory
 */
ble::vendor::cordio::CordioHCIDriver &ble_cordio_get_hci_driver()
{
    static ble::vendor::stm32wb::TransportDriver transport_driver(
        &BleCmdBuffer,
        &SystemCmdBuffer,
        EvtPool,
        SystemSpareEvtBuffer,
        BleSpareEvtBuffer,
        HciAclDataBuffer
    );

    static ble::vendor::stm32wb::HCIDriver hci_driver(
        transport_driver /* other hci driver parameters */
    );

    return hci_driver;
}

static void evt_received(TL_EvtPacket_t *hcievt)
{
    uint16_t len = 0;

    // We need to memcpy the data before passing to higher layers.
    switch (hcievt->evtserial.type) {
        case TL_BLEEVT_PKT_TYPE:
            len = hcievt->evtserial.evt.plen + TL_EVT_HDR_SIZE;
            ble::vendor::stm32wb::TransportDriver::on_data_received((uint8_t *)&hcievt->evtserial, len);
            break;
        case TL_ACL_DATA_PKT_TYPE: {
            TL_AclDataSerial_t *acl = &(((TL_AclDataPacket_t *)hcievt)->AclDataSerial);
            len = acl->length + 5;
            ble::vendor::stm32wb::TransportDriver::on_data_received((uint8_t *)acl, len);
        }
        break;
        default:
            // should not happen - let's block to check
            tr_error("BLE TL evt_received, wrong type:%d", hcievt->evtserial.type);
            break;
    }

    /*  In case Event belongs to the Evt Pool we need to inform  */
    if (((uint8_t *)hcievt >= EvtPool) && ((uint8_t *)hcievt < (EvtPool + POOL_SIZE))) {
        /*  Free the message from shared memory */
        TL_MM_EvtDone(hcievt);
    }
}

/**
 * TL Mailbox synchronisation means
 */

/* Using Semaphore to implemented blocking cmd/resp on system channel */
static rtos::Semaphore sys_event_sem(0, 1);
static rtos::Semaphore sys_resp_sem(0, 1);
static rtos::Semaphore acl_ack_sem(1, 1);

static void acl_data_ack(void)
{
    /**
     * The current implementation assumes the tackGUI will not send a new HCI ACL DATA packet before this ack is received
     * ( which means the CPU2 has handled the previous packet )
     * In order to implement a secure mechanism, it is required either
     * - a flow control with the stack
     * - a local pool of buffer to store packets received from the stack
     */
    acl_ack_sem.release();
    return;
}

static bool acl_data_wait(void)
{

    /* Wait 10 sec for previous ACL command to be ack'ed by Low Layers
     * before sending the next one */
    if (!acl_ack_sem.try_acquire_for(10s)) {
        return false;
    } else {
        return true;
    }
}

static void APPE_SysUserEvtRx(void *pPayload)
{
    TL_AsynchEvt_t *p_sys_event;

    p_sys_event = (TL_AsynchEvt_t *)(((tSHCI_UserEvtRxParam *)pPayload)->pckt->evtserial.evt.payload);

    switch (p_sys_event->subevtcode) {
        case SHCI_SUB_EVT_CODE_READY:
            ((tSHCI_UserEvtRxParam *)pPayload)->status = APPE_SysevtReadyProcessing((SHCI_C2_Ready_Evt_t *)p_sys_event->payload);

            break;

        default:
            break;
    }

    return;
}


static SHCI_TL_UserEventFlowStatus_t APPE_SysevtReadyProcessing(SHCI_C2_Ready_Evt_t *pReadyEvt)
{
    uint8_t fus_state_value;
    SHCI_TL_UserEventFlowStatus_t return_value;

    if (pReadyEvt->sysevt_ready_rsp == WIRELESS_FW_RUNNING) {
        return_value = SHCI_TL_UserEventFlow_Enable;

        if (CFG_OTA_REBOOT_VAL_MSG == CFG_REBOOT_ON_CPU2_UPGRADE) {
            /**
             * The wireless stack update has been completed
             * Reboot on the firmware application
             */
            CFG_OTA_REBOOT_VAL_MSG = CFG_REBOOT_ON_FW_APP;
            NVIC_SystemReset(); /* it waits until reset */
        } else {
            /**
             * Run the Application
             */
            sys_event_sem.release();

        }
    } else {
        /**
         * FUS is running on CPU2
         */
        return_value = SHCI_TL_UserEventFlow_Disable;

        /**
         * The CPU2 firmware update procedure is starting from now
         * There may be several device reset during CPU2 firmware upgrade
         * The key word at the beginning of SRAM1 shall be changed CFG_REBOOT_ON_CPU2_UPGRADE
         *
         * Wireless Firmware upgrade:
         * Once the upgrade is over, the CPU2 will run the wireless stack
         * When the wireless stack is running, the SRAM1 is checked and when equal to CFG_REBOOT_ON_CPU2_UPGRADE,
         * it means we may restart on the firmware application.
         *
         * FUS Firmware Upgrade:
         * Once the upgrade is over, the CPU2 will run FUS and the FUS return the Idle state
         * The SRAM1 is checked and when equal to CFG_REBOOT_ON_CPU2_UPGRADE,
         * it means we may restart on the firmware application.
         */
        fus_state_value = SHCI_C2_FUS_GetState(NULL);

        if (fus_state_value == 0xFF) {
            /**
             * This is the first time in the life of the product the FUS is involved. After this command, it will be properly initialized
             * Request the device to reboot to install the wireless firmware
             */
            NVIC_SystemReset(); /* it waits until reset */
        } else if (fus_state_value != 0) {
            /**
             * An upgrade is on going
             * Wait to reboot on the wireless stack
             */
            while (1) {
                HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
            }
        } else {
            /**
             * FUS is idle
             * Request an upgrade and wait to reboot on the wireless stack
             * The first two parameters are currently not supported by the FUS
             */
            if (CFG_OTA_REBOOT_VAL_MSG == CFG_REBOOT_ON_CPU2_UPGRADE) {
                /**
                 * The FUS update has been completed
                 * Reboot the CPU2 on the firmware application
                 */
                CFG_OTA_REBOOT_VAL_MSG = CFG_REBOOT_ON_FW_APP;
                SHCI_C2_FUS_StartWs();

                while (1) {
                    HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
                }
            } else {
                CFG_OTA_REBOOT_VAL_MSG = CFG_REBOOT_ON_CPU2_UPGRADE;
                /**
                 * Note:
                 * If a reset occurs now, on the next reboot the FUS will be idle and a CPU2 reboot on the
                 * wireless stack will be requested because SRAM1 is set to CFG_REBOOT_ON_CPU2_UPGRADE
                 * The device is still operational but no CPU2 update has been done.
                 */
                SHCI_C2_FUS_FwUpgrade(0, 0);

                while (1) {
                    HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
                }
            }
        }
    }

    return return_value;
}




/*  returns true if ssyevt was received, false otherwise */
static bool sysevt_wait(void)
{
    /*  Wait for 10sec max - if not return an error */
    if (!sys_event_sem.try_acquire_for(10s)) {
        return false;
    } else {
        /*  release immmediately, now that M0 runs */
        sys_event_sem.release();
        return true;
    }
}

/*  returns true if ssyevt was already received, which means M0 core is
 *  already up and running */
static bool sysevt_check(void)
{
    /*  Check if system is UP and runing already */
    if (!sys_event_sem.try_acquire_for(10ms)) {
        return false;
    } else {
        /*  release immmediately as M0 already runs */
        sys_event_sem.release();
        return true;
    }
}

